<?php

namespace Database\Seeders;

use App\Models\Department;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class DepartmentsSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        $departments = [
            "معهد القرآن الكريم",
            "متحف الكفيل",
            "شركة الكفيل",
            "إذاعة الكفيل",
            "موقع الأربعين",
            "البقيع الغرقد",
            "مكتبة العتبة العباسية المقدسة",
            "مركز الكفيل لتقنية المعلومات",
            "مشتل الكفيل",
            "المركز الإسلامي للدراسات الاستراتيجية",
            "جامعة الكفيل",
            "قسم الشؤون الدينية",
            "قناة العقيدة",
            "فرقة العباس القتالية",
            "مستشفى الكفيل التخصصي",
            "مركز الدراسات الأفريقية",
            "المرجع الإلكتروني للمعلوماتية",
            "جامعة العميد",
            "قسم السياحة الدينية",
            "شركة الجود لتكنولوجيا الصناعة والزراعة الحديثة",
            "مكتبة السيدة أم البنين النسوية",
            "شبكة المعارف للتراث الإسلامي",
            "شركة نور الكفيل",
            "المستودع الرقمي العراقي",
            "البوابة العراقية للمعرفة",
            "الملف الاستنادي للمؤلفين العرب",
            "مركز الكفيل الأسري",
            "مركز الكفيل للإنتاج الفني",
            "المرجع الرقمي للتراث المخطوط",
            "المشاريع الثقافية",
            "دار الرسول الأعظم",
            "مركز الشيخ الطوسي",
            "تراث الأنبياء",
            "مركز القمر للإعلام الرقمي",
            "مركز العميد الدولي للبحوث والدراسات",
            "جمعية العميد العلمية والفكرية"
        ];

        for ($i = 0; $i < count($departments); $i++) {
            DB::table('departments')->insert([
                'name' => $departments[$i],
            ]);

        }
    }
}
